echo.
echo        ============================================================
echo          ______   _____  _________  ____    ____   ___   ________  
echo         ^|_   _ \ ^|_   _^|^|  _   _  ^|^|_   \  /   _^|.'   `.^|_   __  ^| 
echo           ^| ^|_) ^|  ^| ^|  ^|_/ ^| ^| \_^|  ^|   \/   ^| /  .-.  \ ^| ^|_ \_^| 
echo           ^|  __'.  ^| ^|      ^| ^|      ^| ^|\  /^| ^| ^| ^|   ^| ^| ^|  _^| _  
echo          _^| ^|__) ^|_^| ^|_    _^| ^|_    _^| ^|_\/_^| ^|_\  `-'  /_^| ^|__/ ^| 
echo         ^|_______/^|_____^|  ^|_____^|  ^|_____^|^|_____^|`.___.'^|________^| 
echo        ============================================================
echo.
echo          》感谢您长期以来的对 比特萌 HEXO 便携版 的关注及支持！《        
echo.
echo                 比特萌 Hexo 便携版控制台（ Windows 平台）
CALL %~dp0版本号.bat
echo.
echo          本程序由 比特萌公司（Bitmoe Inc.） 编写并提供技术支持
echo                 项目主页: https://portablehexo.bitmoe.cn/
echo.